In [1]:
import pandas as pd

In [3]:
schools_data_load="resources/schools_complete.csv"
students_data_load="resources/students_complete.csv"

In [4]:
schools_data_df=pd.read_csv(schools_data_load)
students_data_df=pd.read_csv(students_data_load)

In [6]:
students_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [7]:
schools_data_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [9]:
schools_data_df.count()
students_data_df.count() #there are 39170 rows for each column

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [12]:
students_data_df.notnull().sum()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [13]:
schools_data_df.dtypes

School ID       int64
school_name    object
type           object
size            int64
budget          int64
dtype: object

In [14]:
students_data_df.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
dtype: object

In [15]:
schools_data_df.budget.dtypes

dtype('int64')

In [16]:
schools_data_df["budget"].dtypes

dtype('int64')

In [17]:
prefixes_suffixes = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", " MD", " DDS", " DVM", " PhD"]
for word in prefixes_suffixes:
    students_data_df["student_name"]=students_data_df["student_name"].str.replace(word,"")

<ipython-input-17-b421aa197553>:3: FutureWarning: The default value of regex will change from True to False in a future version.
  students_data_df["student_name"]=students_data_df["student_name"].str.replace(word,"")

In [19]:
school_data_complete_df = pd.merge(students_data_df, schools_data_df, on=["school_name", "school_name"])
school_data_complete_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [44]:
student_count=school_data_complete_df["Student ID"].count()
print(student_count)

39170

In [25]:
school_count_2=len(school_data_complete_df["school_name"].unique())
print(school_count_2)

15

In [27]:
total_budget=schools_data_df["budget"].sum()
print(total_budget)

24649428

In [28]:
average_reading_score=school_data_complete_df["reading_score"].mean()
print(average_reading_score)

81.87784018381414

In [68]:
average_math_score=school_data_complete_df["math_score"].mean()
print(average_math_score)

78.98537145774827

In [34]:
passing_math=school_data_complete_df[school_data_complete_df["math_score"]>=70]
passing_reading=school_data_complete_df[school_data_complete_df["reading_score"]>=70]

In [36]:
passing_reading.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635

In [41]:
passing_math_count=passing_math["math_score"].count()
print(passing_math_count)

29370

In [43]:
passing_reading_count=passing_reading["reading_score"].count()
print(passing_reading_count)

33610

In [46]:
pass_read_percent=passing_reading_count/float(student_count)*100
print(pass_read_percent)

85.80546336482001

In [56]:
pass_math_percent=passing_math_count/float(student_count)*100
print(pass_math_count)

74.9808526933878

In [52]:
passing_both=school_data_complete_df[(school_data_complete_df["math_score"]>=70)&(school_data_complete_df["reading_score"]>=70)]

In [54]:
passing_both_count=passing_both["Student ID"].count()
#OR passing_both.student_name.count()
print(passing_both_count)

25528

In [55]:
overall_passpercent=passing_both_count/float(student_count)*100
print(overall_passpercent)

65.17232575950983

In [69]:
district_summary_df = pd.DataFrame(
          [{"Total Schools": school_count_2,
          "Total Students": student_count,
          "Total Budget": total_budget,
          "Average Math Score": average_math_score,
          "Average Reading Score": average_reading_score,
          "% Passing Math": pass_math_percent,
         "% Passing Reading": pass_read_percent,
        "% Overall Passing": overall_passpercent}])
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,65.172326

In [70]:
district_summary_df.dtypes

Total Schools              int64
Total Students             int64
Total Budget               int64
Average Math Score       float64
Average Reading Score    float64
% Passing Math           float64
% Passing Reading        float64
% Overall Passing        float64
dtype: object

In [71]:
district_summary_df["Average Math Score"]=district_summary_df["Average Math Score"].map("{:.0f}".format)

In [72]:
district_summary_df["Average Reading Score"]=district_summary_df["Average Reading Score"].map("{:.0f}".format)
district_summary_df["% Passing Math"]=district_summary_df["% Passing Math"].map("{:.1f}".format)
district_summary_df["% Passing Reading"]=district_summary_df["% Passing Reading"].map("{:.1f}".format)
district_summary_df["% Overall Passing"]=district_summary_df["% Overall Passing"].map("{: .1f}".format)

In [73]:
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,79,82,75.0,85.8,65.2

In [74]:
# Reorder the columns in the order you want them to appear.
new_column_order = ["Total Schools", "Total Students", "Total Budget","Average Math Score", "Average Reading Score", "% Passing Math", "% Passing Reading", "% Overall Passing"]

# Assign district summary df the new column order.
district_summary_df = district_summary_df[new_column_order]
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,79,82,75.0,85.8,65.2